app/controllers/dishes_controller.rb

SELECT "dishes".* FROM "dishes"
---
  def admin
    @dishes = Dish.all

SELECT  "dishes".* FROM "dishes"   ORDER BY "dishes"."id" ASC LIMIT 1
---
  def index
    @dishes = Dish.all

INSERT INTO "dishes" ("created_at", "dish_name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-05 12:18:44.581385"], ["dish_name", "口水鸡菜饭"], ["price", 40], ["updated_at", "2014-09-05 12:18:44.581385"]]
---
  def create
    @dish = Dish.new(dish_params)

    respond_to do |format|
      if @dish.save

UPDATE "dishes" SET "ImageURL" = ?, "updated_at" = ? WHERE "dishes"."id" = 1  [["ImageURL", "<img src=\"Dish_Images/口水鸡.jpg\" >"], ["updated_at", "2014-09-09 14:43:11.469422"]]
---
  def update
    respond_to do |format|
      if @dish.update(dish_params)

SELECT  "dishes".* FROM "dishes"  WHERE "dishes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_dish
      @dish = Dish.find(params[:id])