app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("created_at", "dish_id", "name", "phone_num", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-10 11:42:55.135385"], ["dish_id", 1], ["name", "Kevin"], ["phone_num", 66702900], ["updated_at", "2014-09-10 11:42:55.135385"]]